### Terraform Plan: `staging/data`
```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.base: Reading...
module.database.random_password.db: Refreshing state... [id=none]
module.database.aws_ssm_parameter.db_password: Refreshing state... [id=/doktori/staging/DB_PASSWORD]
module.database.aws_db_parameter_group.main: Refreshing state... [id=doktori-staging-mysql80]
data.terraform_remote_state.base: Read complete after 2s
module.database.aws_db_subnet_group.main: Refreshing state... [id=doktori-staging-db-subnet-group]
module.database.aws_security_group.rds: Refreshing state... [id=sg-0d9289b53cfc922d5]
module.database.aws_db_instance.main: Refreshing state... [id=db-5M2NLA6GBWRMDW7CCINOFYNI7A]
aws_route53_record.rds: Refreshing state... [id=Z05264372SUQKKOSEJ541_db.staging.doktori.internal_CNAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.database.aws_security_group.rds will be updated in-place
  ~ resource "aws_security_group" "rds" {
        id                     = "sg-0d9289b53cfc922d5"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "allow mysql from staging dms"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-09046426f2ed68a3f",
                ]
              - self             = false
              - to_port          = 3306
            },
            # (1 unchanged element hidden)
        ]
        name                   = "doktori-staging-rds-20260308063637026700000001"
        tags                   = {
            "Name"    = "doktori-staging-rds-sg"
            "Service" = "db"
        }
        # (8 unchanged attributes hidden)
    }

  # module.database.aws_ssm_parameter.db_password must be replaced
-/+ resource "aws_ssm_parameter" "db_password" {
      ~ arn            = "arn:aws:ssm:ap-northeast-2:250857930609:parameter/doktori/staging/DB_PASSWORD" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ has_value_wo   = false -> (known after apply)
      ~ id             = "/doktori/staging/DB_PASSWORD" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "/doktori/staging/DB_PASSWORD" -> "/doktori/staging/db/password" # forces replacement
      ~ tags           = {
          + "Name" = "doktori-staging-db-password"
        }
      ~ tags_all       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-staging-db-password"
          + "Project"     = "doktori"
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 1 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database = {
      ~ db_password_ssm_path = "/doktori/staging/DB_PASSWORD" -> "/doktori/staging/db/password"
        # (7 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```